/**
 * СТЕЙТ: ПАМЯТЬ КОМПОНЕНТА
 * Пользователи взаимодействуют с интерфейсом.
 * Приложение должно реагировать на действия пользователя.
 * Реакт-приложение состоит из компонентов.
 * Основная задача компонентов это вывод информации на экран.
 * Компонентам надо уметь запоминать что они должны выводить на экран.
 * Для этого у них есть специальная память для компонентов: стейт.
 */

// 1. Чтобы добавить стейт-переменную, вверху файла импортируйте useState из реакта.
import { useState } from "react";

export default function Gallery({ gallery }) {
    /**
     * 2. Затем вместо `let index = 0` используем стейт.
     * 
     * Хук useState обеспечивает нас двумя вещами:
     *  - Переменная, сохраненяющая данные между рендерами.
     *  - Функция для изменения этой переменной.
     * 
     * useState всегда возвращает массив из 2-х элементов:
     *    1) стейт-переменная (здесь это index)
     *    2) сеттер-фунция (здесь это setIndex)
     */
    const [index, setIndex] = useState(0) // Использование [] называется деструктуризация и позволяет получать значения из массива.

    function handleClick() {
        // 3. А вот как index и setIndex вместе работают внутри handleClick:
        setIndex(index + 1) // раньше в этой строке было index = index + 1

    }

    let itemObj = gallery[index]
    return (
        <>
            {/* Теперь нажатие на кнопку "Дальше" переключает изображения. */}
            <button onClick={handleClick}>Дальше</button>

            <h1>{itemObj.name}</h1>
            <h3>{itemObj.artist}</h3>
            <h3>({index + 1} / {sculptureList.length})</h3>
            <img src={itemObj.url} alt={itemObj.alt} width="200" />
            <p>{itemObj.description}</p>
        </>
    )
}